def discriminant(a, b, c):
    # Вычисляет дискриминант квадратного уравнения.
    return b**2 - 4 * a * c


if __name__ == "__main__":
    try:
        a = float(input("Введите коэффициент a: "))
        b = float(input("Введите коэффициент b (не может быть 0): "))
        c = float(input("Введите коэффициент c: "))

        if b == 0:
            print("Ошибка: коэффициент b не может быть равен 0.")
        else:
            D = discriminant(a, b, c)
            print(f"\nДискриминант D = {D}")

            if D > 0:
                print("Уравнение имеет два действительных корня.")
            elif D == 0:
                print("Уравнение имеет один действительный корень.")
            else:
                print("Уравнение не имеет действительных корней.")

    except ValueError:
        print("Ошибка: нужно вводить только числа!")
